	// один четыре три ЧетырЕ одно  Четыре четыре ТРИ четыре семь три.
	// Привет мир ! Привет солнце, и ПРИВЕТ луна! Луна...
	#include <stdio.h>
	#include <string.h>
	#include <locale.h>
	#include <Windows.h>
	#define letter(x) (x >= 'A' && x <= 'Z' || x >= 'a' && x <= 'z') || (x >= 'А' && x <= 'Я' || x >= 'а' && x <= 'я')
	#define lenw(x) (arr[x][1] - arr[x][0]+1) 

	//преобразует строку в нижний регистр
	void to_lower(char* p) {
		char* c;
		for (size_t i = 0; i < strlen(p); i++) {
			c = &p[i]; //присваиваем указателю адрес элемента массива
			(*c >= 'A' && *c <= 'Z') ? (*c = *c + 'a' - 'A') : 0;
			(*c >= 'А' && *c <= 'Я') ? (*c = *c + 'a' - 'A') : 0;
		}
	}


	int main() {
		SetConsoleCP(1251);// установка кодовой страницы win-cp 1251 в поток ввода
		SetConsoleOutputCP(1251); // установка кодовой страницы win-cp 1251 в поток вывода

		char* p[2], str[512], str_copy[512] = "", c = '#';
		int n, t, k = 0, i = 0, x = 0, j = 0, arr[100][3], bl;

		p[0] = &str; //присваиваем указателю адрес массива str
		*(p + 1) = &str_copy; //сложение адреса и присвоение указателю адреса массива str_copy
		printf("Введите предложение:\n\n");
		while (p[0][i - 1] != '\n') {
			scanf("%c", &p[0][i]);
			//если буква
			if (letter(p[0][i])) {
				arr[j][0] = i;

				while (letter(p[0][i])) {
					i++;
					scanf("%c", &p[0][i]);
				}
				arr[j][1] = i - 1;
				j++;
			}
			i++;
		}
		p[0][i] = '\0';
		strcat(p[1], p[0]);
		to_lower(*p);

		for (i = 0; i < j; i++) {
			k = 0;
			for (x = 0; x < j; x++) {
				bl = 1;
				//находим повторяющиеся слова, записуем их количество в массив arr[i][2]
				if (lenw(i) == lenw(x) && i != x) {
					for (t = 0; t < lenw(i) && t != -1; t++) {//проверяем сходность каждой буквы, в случае несходности 

						(p[0][arr[i][0] + t] != p[0][arr[x][0] + t]) ? (t = -2) : 0;
					}
					(t != -1) ? (k++) : 0;
				}

			}
			arr[i][2] = k + 1;
		}

		printf("\nВведите n - минимальное количество повторений слов для их удаления:\n\n");
		scanf("%d", &n);
		if (n) {
			k = 0;
			for (i = 0; i < j; i++) //если количество слов не меньше n, переносим строку с начала повторяющего слова на количество символов равная длине слова.
			{
				if (!bl) {
					k += lenw(i - 1);
				}
				bl = 1;
				if (n <= arr[i][2]) {
					// от начала повторяющего слова до конца строки
					for (t = arr[i][0] - k; t < strlen(p[1]) - lenw(i); t++) {
						p[1][t] = p[1][t + lenw(i)];
					}
					p[1][t] = '\0';
					bl = 0;
				}
			}
			printf("\nРедактированное предложение:\n\n%s", *(p + 1));
		}
		else {
			printf("%s", p[0]);
		}
		system("pause");
	}//Привет мир ! Привет солнце привет, и привет луна! Луна...